{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER20_ADI_FOODESERT\DATA\UK_fooddesertdatafinalizedIMD_mergedfinalized.dta",clear
{txt}
{com}. 
. 
. 
. 
. capture drop lncrimescore
{txt}
{com}. gen lncrimescore=ln(crimescore+10) if nation=="England" 
{txt}(18,037 missing values generated)

{com}. 
. histogram lncrimescore
{txt}(bin={res}45{txt}, start={res}1.9129441{txt}, width={res}.01495753{txt})
{res}{txt}
{com}. 
. capture drop zlncrimescore
{txt}
{com}. egen zlncrimescore=std(lncrimescore)
{txt}(18,037 missing values generated)

{com}. 
. 
. reg zfd zemploymentscorerate zlncrimescore  zbarrierstohousingandservscore zeducationskillsandtrainingscore zhealthdeprivationanddisabsc zlivingenvironmentscore if nation=="England" 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    32,844
{txt}{hline 13}{c +}{hline 34}   F(6, 32837)     = {res}  3840.35
{txt}       Model {c |} {res} 11193.1078         6  1865.51797   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 15951.1381    32,837  .485767218   {txt}R-squared       ={res}    0.4124
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4122
{txt}       Total {c |} {res} 27144.2459    32,843  .826484972   {txt}Root MSE        =   {res} .69697

{txt}{hline 33}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                             zfd{col 34}{c |} Coefficient{col 46}  Std. err.{col 58}      t{col 66}   P>|t|{col 74}     [95% con{col 87}f. interval]
{hline 33}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}zemploymentscorerate {c |}{col 34}{res}{space 2} .6210528{col 46}{space 2} .0096062{col 57}{space 1}   64.65{col 66}{space 3}0.000{col 74}{space 4} .6022243{col 87}{space 3} .6398814
{txt}{space 19}zlncrimescore {c |}{col 34}{res}{space 2}-.3912408{col 46}{space 2} .0050034{col 57}{space 1}  -78.20{col 66}{space 3}0.000{col 74}{space 4}-.4010477{col 87}{space 3} -.381434
{txt}{space 2}zbarrierstohousingandservscore {c |}{col 34}{res}{space 2} .2139314{col 46}{space 2} .0040874{col 57}{space 1}   52.34{col 66}{space 3}0.000{col 74}{space 4}   .20592{col 87}{space 3} .2219429
{txt}zeducationskillsandtrainingscore {c |}{col 34}{res}{space 2} .1653638{col 46}{space 2} .0070684{col 57}{space 1}   23.39{col 66}{space 3}0.000{col 74}{space 4} .1515094{col 87}{space 3} .1792182
{txt}{space 4}zhealthdeprivationanddisabsc {c |}{col 34}{res}{space 2}-.1734691{col 46}{space 2}  .007763{col 57}{space 1}  -22.35{col 66}{space 3}0.000{col 74}{space 4}-.1886849{col 87}{space 3}-.1582534
{txt}{space 9}zlivingenvironmentscore {c |}{col 34}{res}{space 2} .0794303{col 46}{space 2} .0044819{col 57}{space 1}   17.72{col 66}{space 3}0.000{col 74}{space 4} .0706457{col 87}{space 3}  .088215
{txt}{space 27}_cons {c |}{col 34}{res}{space 2}-.0579675{col 46}{space 2} .0038469{col 57}{space 1}  -15.07{col 66}{space 3}0.000{col 74}{space 4}-.0655075{col 87}{space 3}-.0504274
{txt}{hline 33}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg zfd  zsimd2020_employment_domain_rank zsimd2020_housing_domain_rank zsimd2020_education_domain_rank   if nation=="Scotland"

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,976
{txt}{hline 13}{c +}{hline 34}   F(3, 6972)      = {res}   502.71
{txt}       Model {c |} {res} 1935.64337         3  645.214457   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8948.31132     6,972  1.28346404   {txt}R-squared       ={res}    0.1778
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1775
{txt}       Total {c |} {res} 10883.9547     6,975  1.56042361   {txt}Root MSE        =   {res} 1.1329

{txt}{hline 33}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                             zfd{col 34}{c |} Coefficient{col 46}  Std. err.{col 58}      t{col 66}   P>|t|{col 74}     [95% con{col 87}f. interval]
{hline 33}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zsimd2020_employment_domain_rank {c |}{col 34}{res}{space 2}-.4586046{col 46}{space 2} .0271017{col 57}{space 1}  -16.92{col 66}{space 3}0.000{col 74}{space 4}-.5117321{col 87}{space 3}-.4054771
{txt}{space 3}zsimd2020_housing_domain_rank {c |}{col 34}{res}{space 2} .3800179{col 46}{space 2} .0188802{col 57}{space 1}   20.13{col 66}{space 3}0.000{col 74}{space 4} .3430069{col 87}{space 3} .4170289
{txt}{space 1}zsimd2020_education_domain_rank {c |}{col 34}{res}{space 2}-.2768445{col 46}{space 2}  .027945{col 57}{space 1}   -9.91{col 66}{space 3}0.000{col 74}{space 4}-.3316251{col 87}{space 3}-.2220638
{txt}{space 27}_cons {c |}{col 34}{res}{space 2} .1812126{col 46}{space 2}  .013564{col 57}{space 1}   13.36{col 66}{space 3}0.000{col 74}{space 4}  .154623{col 87}{space 3} .2078022
{txt}{hline 33}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg zfd  zEmployment_Score2019   zHealth_Score2019 zEducation_Score2019 if nation=="Wales"

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,909
{txt}{hline 13}{c +}{hline 34}   F(3, 1905)      = {res}    58.31
{txt}       Model {c |} {res} 260.261947         3  86.7539823   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2834.47849     1,905  1.48791522   {txt}R-squared       ={res}    0.0841
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0827
{txt}       Total {c |} {res} 3094.74044     1,908  1.62198136   {txt}Root MSE        =   {res} 1.2198

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  zfd{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      t{col 55}   P>|t|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zEmployment_Score2019 {c |}{col 23}{res}{space 2} .6621735{col 35}{space 2} .0658855{col 46}{space 1}   10.05{col 55}{space 3}0.000{col 63}{space 4} .5329582{col 76}{space 3} .7913888
{txt}{space 4}zHealth_Score2019 {c |}{col 23}{res}{space 2}-.5006568{col 35}{space 2} .0718036{col 46}{space 1}   -6.97{col 55}{space 3}0.000{col 63}{space 4}-.6414786{col 76}{space 3}-.3598349
{txt}{space 1}zEducation_Score2019 {c |}{col 23}{res}{space 2}  .127119{col 35}{space 2} .0523657{col 46}{space 1}    2.43{col 55}{space 3}0.015{col 63}{space 4}  .024419{col 76}{space 3} .2298191
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} .3678141{col 35}{space 2} .0279181{col 46}{space 1}   13.17{col 55}{space 3}0.000{col 63}{space 4} .3130608{col 76}{space 3} .4225674
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER20_ADI_FOODESERT\DATA\UK_fooddesertdatafinalizedIMD_mergedfinalized.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER20_ADI_FOODESERT\DATA\UK_fooddesertdatafinalizedIMD_mergedfinalized.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}